tap "dracula/install"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
# OpenType text shaping engine
brew "harfbuzz"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# Development kit for the Java programming language
brew "openjdk"
# ANother Tool for Language Recognition
brew "antlr"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Shell extension to jump to frequently used directories
brew "autojump"
# Official Amazon AWS command-line interface
brew "awscli"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# Console version of 2048
brew "c2048"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Framework for layout and rendering of i18n text
brew "pango"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Interactive computing in Python
brew "ipython", link: false
# Utility to optimize JPEG files
brew "jpegoptim"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Implementation of JSON Schema for Python
brew "jsonschema"
# Statically typed programming language for the JVM
brew "kotlin"
# LastPass command-line interface tool
brew "lastpass-cli"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Drive some car across the moon
brew "moon-buggy"
# Open source relational database management system
brew "mysql"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Classic snake game with textual interface
brew "nsnake"
# Ncurses based sudoku game
brew "nudoku"
# Pacman for console
brew "pacman4console"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Create beautiful image of your source code
brew "silicon"
# Language for application scale JavaScript development
brew "typescript"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Dark theme for GitKraken
cask "dracula-gitkraken"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Monospaced font with cursive italics and programming symbol ligatures
cask "font-victor-mono"
# GPU-based terminal emulator
cask "kitty"
# Clipboard manager
cask "maccy"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Team communication and collaboration software
cask "slack"
# Multimedia player
cask "vlc"
