tap "dracula/install"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
# OpenType text shaping engine
brew "harfbuzz"
# ANother Tool for Language Recognition
brew "antlr"
# Official Amazon AWS command-line interface
brew "awscli"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# Console version of 2048
brew "c2048"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GNU compiler collection
brew "gcc"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Framework for layout and rendering of i18n text
brew "pango"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Interactive computing in Python
brew "ipython"
# Implementation of JSON Schema for Python
brew "jsonschema"
# Statically typed programming language for the JVM
brew "kotlin"
# LastPass command-line interface tool
brew "lastpass-cli"
# Drive some car across the moon
brew "moon-buggy"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Classic snake game with textual interface
brew "nsnake"
# Ncurses based sudoku game
brew "nudoku"
# Pacman for console
brew "pacman4console"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Safe, concurrent, practical language
brew "rust"
# Language for application scale JavaScript development
brew "typescript"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Dark theme for GitKraken
cask "dracula-gitkraken"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Clipboard manager
cask "maccy"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Video game digital distribution service
cask "steam"
# Multimedia player
cask "vlc"
